Revit 2026 API

# CurtainSystemCurtainSystemType Property

---

get or set the type of the CurtainSystem.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurtainSystemType CurtainSystemType { get; set; }
```
```vb
Public Property CurtainSystemType As CurtainSystemType
	Get
	Set
```
```cpp
public:
property CurtainSystemType^ CurtainSystemType {
	CurtainSystemType^ get ();
	void set (CurtainSystemType^ value);
}
```
```fsharp
member CurtainSystemType : CurtainSystemType with get, set
```

#### Property Value

CurtainSystemType

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the specified parameter curtainSystemType is . |
| InvalidOperationException | Thrown when the type of the CurtainSystem cannot be changed to the specified one. |

#### Reference

CurtainSystem Class

Autodesk.Revit.DB Namespace